{
  "stdData": {
    "locale": "uk_UA",
    "images": [
      {
        "url": "/meta/og-image.jpg",
        "width": 1200,
        "height": 630,
        "alt": "Avto-magaz — інтернет-магазин автотоварів"
      }
    ]
  },
  "home": {
    "title": "Avto-magaz — інтернет-магазин автозапчастин та автохімії",
    "description": "Avto-magaz — надійний інтернет-магазин автозапчастин, технічних рідин та автоаксесуарів. Швидка доставка по Україні. Оригінальні товари від перевірених брендів.",
    "keywords": "автозапчастини, купити автозапчастини, інтернет-магазин запчастин, магазин автотоварів, автохімія, моторне масло, трансмісійне масло, технічні рідини, гальмівна рідина, склоочисники, автоаксесуари, акумулятори, стартери, фільтри повітряні та паливні, запчастини для іномарок і ВАЗ, Toyota, BMW, Renault, Audi, Hyundai, Skoda, Mitsubishi, Mazda, оригінальні та неоригінальні запчастини, недорогі автозапчастини, доставка по Україні",
    "canonical": "/"
  },
  "vinRequest": {
    "title": "Підбір автозапчастин по VIN-коду | Avto-magaz",
    "description": "Вкажіть VIN-код Вашого автомобіля — це дозволить точно підібрати запчастини. Заповніть форму, і наші фахівці швидко підберуть потрібні автозапчастини для Вашої машини.",
    "keywords": "підбір запчастин по VIN, знайти запчастини за VIN, автозапчастини за VIN кодом, підбір автозапчастин, VIN код перевірка, пошук автозапчастин, купити запчастини за VIN, пошук деталей по VIN номеру, avto-magaz vin запит",
    "canonical": "/vin-request"
  },
  "cart": {
    "title": "Кошик товарів | Avto-magaz",
    "description": "Перегляньте товари, які Ви додали до кошика перед оформленням замовлення.",
    "keywords": "кошик, замовлення, автозапчастини, Avto-magaz",
    "canonical": "/cart",
    "noindex": true
  },
  "checkout": {
    "title": "Оформлення замовлення | Avto-magaz",
    "description": "Заповніть контактну інформацію, виберіть спосіб доставки та оплати — і завершіть оформлення замовлення на сайті Avto-magaz.",
    "keywords": "оформлення замовлення, автозапчастини доставка, оплата товарів, підтвердження покупки",
    "canonical": "/checkout",
    "robots": {
      "index": false,
      "follow": false,
      "nocache": true
    }
  },
  "checkoutResult": {
    "title": "Замовлення успішно оформлено | Avto-magaz",
    "description": "Дякуємо! Ваше замовлення прийнято та буде оброблено найближчим часом. Очікуйте на дзвінок менеджера.",
    "keywords": "успішне замовлення, підтвердження покупки, avto-magaz замовлення",
    "canonical": "/checkout/result",
    "robots": {
      "index": false,
      "follow": false,
      "nocache": true
    }
  },
  "searchProducts": {
    "title": "Пошук автозапчастин | Avto-magaz",
    "description": "Шукайте автозапчастини, масла, автохімію та аксесуари в інтернет-магазині Avto-magaz. Зручний пошук за назвою, артикулом або брендом.",
    "keywords": "пошук автозапчастин, знайти запчастини, автозапчастини за назвою, знайти масло для авто, запчастини за артикулом, автохімія пошук",
    "canonical": "/search-products",
    "robots": {
      "index": true,
      "follow": true,
      "nocache": true
    }
  }
}
